quanhengwen/STM32F1xWorkSpace19/Examples/WOW/AMPTest.C
#ifdef AMPTest

#include "AMPTest.H"

#include "string.h"				//串和内存操作函数头文件
//#include "stm32f10x_dma.h"

#include "LCD.H"
#include "NAND.H"
#include "SHT20M.H"
#include "SHT20.H"
#include "BT459A.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_ADC.H"
#include "STM32_WDG.H"
#include "STM32_FSMC.H"
#include "STM32_PWM.H"
//#include "STM32_PWM.H"
//#include "STM32_GPIO.H"
#include "STM32_USART.H"
#include "STM32_RTC.H"
#include 	"CRC.H"
#include "XPT2046.H"

//#include 	"Image.H"
//#include "MMC_SD.h"
#include "FatFsAPI.h"			/* 自定义API接口*/

//#include "STM32_SDCard.H"
//#include "GT32L32M0180.H"
#include 	"TOOL.H"

//#define SDCardTest
//#define GT32L32M0180Test
//把TFT看做类似SRAM的存储器，只能接在 BANK1上。对应基地址是0x60000000.
//而BANK1又有划分为四个片选,分别对应基地址:
//NE1 0x600000000
//NE2 0x640000000
//NE3 0x680000000
//NE4 0x6C0000000

////数据区地址
//#define Bank1_LCD_Data ((u32)0x6C100000)
////寄存器区地址
//#define Bank1_LCD_Reg ((u32)0x6C000000)

LCDDef	sLCD;

sht20def 		sht20;
spi_def			xpt2046;
//spi_def* pInfo

#define ussize  256     //串口缓存大小
unsigned char u1txbuffer[ussize];
unsigned char u1rxbuffer[ussize];
unsigned char u3txbuffer[ussize];
unsigned char u3rxbuffer[ussize];
unsigned char u2txbuffer[ussize];
unsigned char u2rxbuffer[ussize];
unsigned short u1dsp=32;
unsigned short u3dsp=32;
unsigned short u1dspcolr=LCD565_RED;
unsigned short u3dspcolr=LCD565_RED;

//u8 GTBuffer[512]={0};		//点阵数据存储空间

u32	dspdata=0;
u16 us=0;
u16	mm=0;
u8	ss=0;
u8	hh=0;

u8 bsr  = 0x08;

u16 time=0;
u32 ADCDATA = 0;
//void GT32L32_PinSet(void);
#define FileNum 16
FRESULT result;       //FatFs 函数公共结果代码
FATFS   FatFsObj[1];  //逻辑驱动器的工作区(文件系统对象)
DIR     dir;          //目录对象结构体
FILINFO fno;          //文件信息结构体
FIL fsrc, fdst;       //文件对象
BYTE buffer[4096];    //文件拷贝缓冲区
char FilSearchInf[FileNum][13]={0,0};    //存储查找到的文件名数组
unsigned char LenName = 0;

UINT br, bw;          //文件读/写字节计数
u16 xh=0,yv=0;
char Key = 0;
unsigned  short color = 0;
unsigned	short	Rait	=	0;
unsigned	long	ImageAr	=	0;
unsigned	short	sysledtime=0;
unsigned	char	sysledflag=0;
unsigned	short	Ratio	=	0;

unsigned char txflg = 0;
//unsigned char OpenLed[]={0x7E,0x09,0x03,0x01,0x01,0x01,0x01,0x01,0xB0,0x2C,0x6D,0x84,0xF3,0x7F};  //Address1中控制输出端口1以LED驱动的方式打开
//unsigned char ClosLed[]={0x7E,0x09,0x03,0x01,0x01,0x01,0x01,0x00,0x4D,0x13,0x30,0xC4,0xF6,0x7F};  //Address1中控制输出端口1以LED驱动的方式关闭

unsigned char OpenLed[]={0x7E,0x09,0x03,0x01,0x01,0x01,0x01,0x01,0x57,0x29,0x51,0x84,0xF3,0x7F};  //Address1中控制输出端口1以LED驱动的方式打开
unsigned char ClosLed[]={0x7E,0x09,0x03,0x01,0x01,0x01,0x01,0x00,0x00,0x00,0x00,0xC4,0xF6,0x7F};  //Address1中控制输出端口1以LED驱动的方式关闭

 u16 year; 
 u8 month;
 u8 day;
 u8 hour;
 u8 minute;
 u8 second;
u16 millisecond=0;

float	Temperature	=	0.0;
float	humidity	=	0.0;

unsigned short crc16mbs = 0;

unsigned short xpt2046x,xpt2046y;


RS485Def RS485A;
RS485Def RS485B;

void GetTime(void);
void ClockServer(void);
void SYSLED(void);
void USART_TEST(void);
void RS485Configuration(void);
static void xpt2046TEST(void);
static void BT459ATEST(void);
static void SHT20TEST(void);
static void SHT20MTEST(void);
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPTest_Configuration(void)
{	
//  RCC_ClocksTypeDef RCC_ClocksStatus;							//时钟状态---时钟值
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	
	

  Power_Configuration();
	
	//xpt2046_configuration();
	
  LCD_Configuration();	
	
	xpt2046_configuration();
	
  RTC_Configuration();
//  SD_Configuration();
	sht20_configuration();
  GetTime();
  
	
	
  LCD_SetBackground(LCD565_WHITE);
  LCD_ShowBattery(780,2,2,LCD565_GRED);   //显示12x12电池
  LCD_ShowAntenna(760,2,3,LCD565_GRED);   //显示12x12天线

  
//  LCD_Printf(10,10,32,LCD565_BRED,"FSMC液晶屏驱动测试：%0.4d年%0.2d月%0.2d日%0.2d时%0.2d分%0.2d秒",
//    year,month,day,hour,minute,second);  //后边的省略号就是可变参数
  
  
  api_usart_dma_configurationNR	(USART1,19200,ussize);	//USART_DMA配置--查询方式，不开中断
  api_usart_dma_configurationNR	(USART3,19200,ussize);	//USART_DMA配置--查询方式，不开中断
  RS485Configuration();
	PWM_OUT(TIM2,PWM_OUTChannel1,100,900);						//PWM设定-20161127版本
	
	
//  IWDG_Configuration(1000);													//独立看门狗配置---参数单位ms
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPTest_Server(void)
{
//  ClockServer();
  RTC_Server();
//	USART_Server();
  //USART_TEST();	
		
	BT459ATEST();
	
	SHT20MTEST();		//温湿度模块测试
	
	SHT20TEST();
	
	xpt2046TEST();
	
}
//------------------------------------------------------------------------------





/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void xpt2046TEST(void)
{
	static unsigned short time=0;
	if(time++<200)
		return;
	time =0;
	xpt2046x	=	0;
	xpt2046y	=	0;
	api_xpt2046_get_coordinate(&xpt2046x,&xpt2046y);
	LCD_Printf(600,0,16,LCD565_BLACK,"x轴%0.6d  y轴%0.6d",xpt2046x,xpt2046y);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BT459ATEST(void)
{
	unsigned char* frame	=	NULL;
	unsigned char len	=	0;
	len	=	api_bt459a_get_frame_ReadQuantity(0x01,frame);
	
	len	=	api_bt459a_get_frame_SetQuantity(0x01,50,frame);
	len	=	api_bt459a_get_frame_SetQuantity(0x02,50,frame);
	len	=	api_bt459a_get_frame_SetQuantity(0x03,50,frame);
	len	=	api_bt459a_get_frame_SetQuantity(0x04,50,frame);
	
	//api_rs485_dma_send(&RS485B,frame,len);	//RS485-DMA发送程序
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SHT20TEST(void)
{
	unsigned char RxNum	=	0;
	static unsigned short time	=	0;
	api_sht20_server();
	
	if(time++<200)
	{
		return ;
	}
	time=	0;
//	api_sht20_set_mode_slave();
//	return ;
	Temperature	=	api_sht20_get_temperature();
	humidity	=	api_sht20_get_humidity();
	//LCD_Printf(500,u1dsp,16,LCD565_BLACK,"SHT20:温度%0.2f℃  湿度%0.2f%%",Temperature,humidity);
	LCD_Printf(500,32,16,LCD565_BLACK,"SHT20:温度%0.2f℃  湿度%0.2f%%",Temperature,humidity);

