quanhengwen/STM32F1xWorkSpace19/Examples/WOW/AMPTest.C
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SHT20MTEST(void)
{
	unsigned char RxNum	=	0;
	static unsigned short time	=	0;
	if(time++>500)
	{
		u2txbuffer[0]=0x01;
		u2txbuffer[1]=0x04;
		u2txbuffer[2]=0x00;
		u2txbuffer[3]=0x01;
		u2txbuffer[4]=0x00;
		u2txbuffer[5]=0x02;
		u2txbuffer[6]=0x20;
		u2txbuffer[7]=0x0B;
		
		RxNum	=	api_rs485_dma_send(&RS485B,u2txbuffer,8);	//RS485-DMA发送程序
		if(RxNum)
		{
//			LCD_ShowHex(260,u1dsp,16,u1dspcolr,8,8,u2txbuffer);			
			time = 0;
			return;
		}		
	}
		
	
	
	
	RxNum = api_rs485_dma_receive(&RS485B,u2rxbuffer);
	if(RxNum)
	{
		double t1	=	0.0;		//温度
		double t2	=	0.0;		//湿度
		unsigned short temp=0;
		temp	=	u2rxbuffer[3]<<8|u2rxbuffer[4];
		t1	=	(double)temp/10.0;
		temp	=	u2rxbuffer[5]<<8|u2rxbuffer[6];
		t2	=	(double)temp/10.0;
		
		memcpy(u1txbuffer,u2rxbuffer,RxNum);
    api_usart_dma_send(USART1,u1txbuffer,RxNum);
//    LCD_ShowHex(0,u1dsp,16,u1dspcolr,RxNum,8,u1txbuffer);
		
		LCD_Printf(10,u1dsp,16,LCD565_BLACK,"SHT20M:温度%0.2f℃  湿度%0.2f%%",t1,t2);
		
		u1dsp+=(RxNum/33+1)*16;
		if(LCD565_RED==u1dspcolr)
		{
			u1dspcolr = LCD565_BLUE;
		}
		else
		{
			u1dspcolr = LCD565_RED;
		}
    if(u1dsp>=479)
    {
      LCD_Fill(0,32,800,480,sLCD.Data.BColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
      u1dsp=32;
      u3dsp=32;
    }		
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void xpt2046_configuration(void)
{
	xpt2046.port.clk_port		=	GPIOB;
	xpt2046.port.clk_pin		=	GPIO_Pin_13;
	xpt2046.port.miso_port	= GPIOB;
	xpt2046.port.miso_pin		=	GPIO_Pin_14;
	xpt2046.port.mosi_port	=	GPIOB;
	xpt2046.port.mosi_pin		=	GPIO_Pin_15;
	xpt2046.port.nss_port		=	GPIOG;
	xpt2046.port.nss_pin		= GPIO_Pin_7;
	
	xpt2046.port.SPIx				=	SPI2;
	xpt2046.port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_8;
	
	api_xpt2046_configuration(&xpt2046);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void sht20_configuration(void)
{
	sht20.iic.port.SCL_Port	=	GPIOC;
	sht20.iic.port.SCL_Pin	=	GPIO_Pin_8;
	sht20.iic.port.SDA_Port	=	GPIOC;
	sht20.iic.port.SDA_Pin	=	GPIO_Pin_9;	
	
	api_sht20_configuration(&sht20);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RS485Configuration(void)
{
	RS485B.USARTx	=	USART2;
	RS485B.RS485_CTL_PORT	=	GPIOA;
	RS485B.RS485_CTL_Pin	=	GPIO_Pin_1;
	RS485B.RS485_TxEn_PORT	=	GPIOA;
	RS485B.RS485_TxEn_Pin		=	GPIO_Pin_1;
	RS485B.RS485_RxEn_PORT	=	GPIOA;
	RS485B.RS485_RxEn_Pin		=	GPIO_Pin_1;
	
	api_rs485_dma_configurationNR(&RS485B,9600,ussize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void USART_TEST(void)
{
  unsigned short RxNum  = 0;
  static  unsigned  short serial  = 0;
  static  unsigned  short testtime  = 0;
  
  if(testtime++>1000)
  {
    unsigned  short crc16 = 0;
    testtime  = 0;
    serial++;
    memcpy(u3txbuffer,&serial,2);
    if(0  !=  txflg)  //开LED
    {
      txflg = 0;
      crc16 = CRC16_MODBUS(&OpenLed[1],10);
      memcpy(&OpenLed[11],&crc16,2);
      api_usart_dma_send(USART3,OpenLed,sizeof(OpenLed));
    }
    else  //关LED
    {
      txflg = 1;
      crc16 = CRC16_MODBUS(&ClosLed[1],10);
      memcpy(&ClosLed[11],&crc16,2);
      api_usart_dma_send(USART3,ClosLed,sizeof(ClosLed));
    }
  }

  RxNum = api_usart_dma_receive(USART1,u1rxbuffer);
  if(RxNum)
  {
    memcpy(u3txbuffer,u1rxbuffer,RxNum);
    api_usart_dma_send(USART3,u3txbuffer,RxNum);
    LCD_ShowHex(0,u1dsp,16,u1dspcolr,RxNum,8,u3txbuffer);
    u1dsp+=16;
    if(u1dsp>=479)
    {
      if(LCD565_RED !=  u1dspcolr)
      {
        u1dspcolr = LCD565_RED;
      }
      else
      {
        u1dspcolr = LCD565_BLUE;
      }
      u1dsp=32;
    }
  }
  RxNum = api_usart_dma_receive(USART3,u3rxbuffer);
  if(RxNum)
  {
    memcpy(u1txbuffer,u3rxbuffer,RxNum);
    api_usart_dma_send(USART1,u1txbuffer,RxNum);
    LCD_ShowHex(400,u3dsp,16,u3dspcolr,RxNum,8,u1txbuffer);
    u3dsp+=16;
    if(u3dsp>=479)
    {
      if(LCD565_RED !=  u3dspcolr)
      {
        u3dspcolr = LCD565_RED;
      }
      else
      {
        u3dspcolr = LCD565_BLUE;
      }
      u3dsp=32;
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void USART_Server(void)
{
  unsigned short RxNum  = 0;
  RxNum = api_usart_dma_receive(USART1,u1rxbuffer);
  if(RxNum)
  {
    memcpy(u3txbuffer,u1rxbuffer,RxNum);
    
    crc16mbs  = CRC16_MODBUS(&u3txbuffer[1],u3txbuffer[1]+1);
    
    memcpy(&u3txbuffer[u3txbuffer[1]+2],&crc16mbs,2);
    
    api_usart_dma_send(USART3,u3txbuffer,RxNum);
		api_rs485_dma_send(&RS485B,u3txbuffer,RxNum);	//RS485-DMA发送程序
    LCD_ShowHex(0,u1dsp,16,u1dspcolr,RxNum,8,u3txbuffer);
    u1dsp+=(RxNum/33+1)*16;
    if(LCD565_RED==u1dspcolr)
		{
			u1dspcolr = LCD565_BLUE;
		}
		else
		{
			u1dspcolr = LCD565_RED;
		}
    if(u1dsp>=479)
    {
      LCD_Fill(0,32,800,480,sLCD.Data.BColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
      u1dsp=32;
      u3dsp=32;
    }
  }
  RxNum = api_usart_dma_receive(USART3,u3rxbuffer);
  if(RxNum)
  {		
    memcpy(u1txbuffer,u3rxbuffer,RxNum);
    api_usart_dma_send(USART1,u1txbuffer,RxNum);
    LCD_ShowHex(0,u3dsp,16,u3dspcolr,RxNum,8,u1txbuffer);
    u3dsp+=16;
    if(u3dsp>=479)
    {
      if(LCD565_RED !=  u3dspcolr)
      {
        u3dspcolr = LCD565_RED;
      }
      else
      {
        u3dspcolr = LCD565_BLUE;
      }
      LCD_Fill(0,32,800,480,sLCD.Data.BColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
      u3dsp=32;
    }
  }
	RxNum = api_rs485_dma_receive(&RS485B,u2rxbuffer);
	if(RxNum)
	{
		memcpy(u1txbuffer,u2rxbuffer,RxNum);
    api_usart_dma_send(USART1,u1txbuffer,RxNum);
    LCD_ShowHex(0,u1dsp,16,u1dspcolr,RxNum,8,u1txbuffer);
		u1dsp+=(RxNum/33+1)*16;
		if(LCD565_RED==u1dspcolr)
		{
			u1dspcolr = LCD565_BLUE;
		}
		else
		{
			u1dspcolr = LCD565_RED;
		}
    if(u1dsp>=479)
    {
      LCD_Fill(0,32,800,480,sLCD.Data.BColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
      u1dsp=32;
      u3dsp=32;
    }
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void SYSLED(void)
{
	if(sysledtime++>200)
	{
		sysledtime	=	0;
		if(0==sysledflag)
		{
			Ratio+=1;
			if(Ratio>35)
			{
				sysledflag	=	1;
			}
		}
		else
		{
			Ratio-=1;
			if(Ratio<=20)
			{
				sysledflag	=	0;
			}
		}
		PWM_OUT(TIM2,PWM_OUTChannel1,2000,Ratio*Ratio);						//PWM设定-20161127版本
//		SetPWM_Ratio(Ratio*Ratio);		//设置占空比---LED
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RTC_Server(void)
{
  static unsigned char  sec=0;  
  if(sec!=calendar.sec)
  {
    if(0==calendar.w_year||0==calendar.w_month||0==calendar.w_date)
    {
      RTC_Get();
      if(0==calendar.w_year||0==calendar.w_month||0==calendar.w_date)
      {
        GetTime();
        RTC_Set(year,month,day,hour,minute,second+9);   //编译下载时间会慢7秒
      }
    }
//    if(0==calendar.sec)
//      LCD_Clean(sLCD.Data.BColor);	//清除屏幕函数
    sec=calendar.sec;
    LCD_Printf(0,0,32,LCD565_BLACK,"RTC时钟:%0.4d年%0.2d月%0.2d日%0.2d时%0.2d分%0.2d秒",
    calendar.w_year,calendar.w_month,calendar.w_date,calendar.hour,calendar.min,calendar.sec);
  }
}

