quanhengwen/STM32F1xWorkSpace19/Examples/WOW/AMPTest.C
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void GetTime(void)
{
	BuildTimeDef*	BuildTime	=	GetBuildTime(__DATE__,__TIME__);
	
  year  	= BuildTime->year;
  month 	= BuildTime->month;
  day   	= BuildTime->day;
  hour  	= BuildTime->hour;
  minute  = BuildTime->minute;
	
  second  = BuildTime->second;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ClockServer(void)
{
  static char Flag = 0;
  if(Flag== 0)
  {
    Flag= 1;
    
    LCD_Printf(0,220,32,LCD565_RED,"%0.4d-",year);		//编译日期
    LCD_Printf(5*16,220,32,LCD565_RED,"%0.2d-",month);		//编译日期
    LCD_Printf(8*16,220,32,LCD565_RED,"%0.2d",day);		//编译日期
    
    LCD_Printf(13*16,220,32,LCD565_RED,"%0.2d:",hour);		//编译日期
    LCD_Printf(16*16,220,32,LCD565_RED,"%0.2d:",minute);		//编译日期
    LCD_Printf(19*16,220,32,LCD565_RED,"%0.2d",second);		//编译日期    
  }
  if(++millisecond>999)
  {
    millisecond = 0;
    if(++second>59)
    {    
      second  = 0;
      if(++minute>59)
      {  
        minute  = 0;
        if(++hour>=24)
        { 
          hour = 0;
          LCD_Printf(8*16,220,32,LCD565_RED,"%0.2d",++day);		//编译日期
        }
        LCD_Printf(13*16,220,32,LCD565_RED,"%0.2d:",hour);		//编译日期      
      }
      LCD_Printf(16*16,220,32,LCD565_RED,"%0.2d:",minute);		//编译日期    
    }
    LCD_Printf(19*16,220,32,LCD565_RED,"%0.2d",second);		//编译日期
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Power_Configuration(void)
{
  unsigned  short  temp  = 0;
  GPIO_Configuration_IPU(GPIOB,	GPIO_Pin_4);			//将GPIO相应管脚配置为上拉输入模式----V20170605
  GPIO_Configuration_OPP50(GPIOF,GPIO_Pin_10);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
  restart:
  PF10 = 1;
	SysTick_DeleymS(1000);					//SysTick延时nS
//  while(0  ==  PB4in)
//  {
//    SysTick_DeleymS(1);					//SysTick延时nS
//    temp++;
//    if(temp>3000)
//    {
//      Key = 0;
//      
//      break;
//    }
//    
//  }
//  if(temp<3000)
//  {
//    PF10  = 1;
//    temp  = 0;
//    goto restart;
//  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Power_Server(void)
{
  unsigned  short  temp  = 0;

  if((0  ==  PB4in)&&(1==Key))
  {
    while(0  ==  PB4in)
    {
      SysTick_DeleymS(1);					//SysTick延时nS
      temp++;
      if(temp>3000)
      {
        Key = 0;
        PF10  = 0;
        PWM_OUT(TIM2,PWM_OUTChannel1,1000,110);						//PWM设定-20161127版本
        while(0  ==  PB4in);
        NVIC_GenerateCoreReset();
      }
    }
  }
  else if(1 ==PB4in)
  {
    Key = 1;
  }
  
  if(temp<3000)
  {
    PF10  = 1;
//    while(1);
  }
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void LCD_Server(void)			//显示服务相关
{

}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void LCD_Configuration(void)
{
  //=======================LCD端口
	LCDPortDef	*LcdPort	=	&sLCD.Port;
  
  LcdPort->sBL_PORT   = GPIOA;
  LcdPort->sBL_Pin    = GPIO_Pin_0;
  
  LcdPort->sCS_PORT   = GPIOG;
  LcdPort->sCS_Pin    = GPIO_Pin_12;
  
  LcdPort->sREST_PORT = NULL;
  LcdPort->sREST_Pin  = 0;
  
  //sLCD.Data.FsmcRegAddr   = (unsigned long)0x6C000000;
  //sLCD.Data.FsmcDataAddr  = (unsigned long)0x6C100000;
	sLCD.Data.FsmcRegAddr   = (unsigned long)0x6C000000;
  sLCD.Data.FsmcDataAddr  = (unsigned long)0x6C100000;
  
  sLCD.Data.BColor	=	LCD565_WHITE;
	sLCD.Data.PColor	=	LCD565_BLACK;
	sLCD.Flag.Rotate	=	Draw_Rotate_0D;
	
	//=======================字库端口
	sLCD.GT32L32.SPI.port.SPIx	    =	SPI2;
	sLCD.GT32L32.SPI.port.nss_port	=	GPIOB;
	sLCD.GT32L32.SPI.port.nss_pin		=	GPIO_Pin_12;
	sLCD.GT32L32.SPI.port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_8;
  
  LCDFsmc_Initialize(&sLCD);  
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SD_Configuration(void)
{
  u16 da=0;
//  u16 color;
  
  
  
  LCD_Printf (0,0,16,LCD565_GREEN,"STM32F1xWorkSpace--(MmcSDTest)SD卡读取");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
  LCD_Printf (0,16,16,LCD565_GREEN,"为驱动器注册工作区......");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
  //========================为逻辑驱动器注册工作区
  result = f_mount(&FatFsObj[0],"0:",1);    //在FatFs模块上注册/注销一个工作区(文件系统对象)
  if(0  ==  result)
  {
    u32 sd_size;
    u32 free;
    LCD_Printf (0,32,16,LCD565_GREEN,"驱动器注册成功");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
    //========================得到容量信息，包括总容量和剩余容量
    result = SD_disk_getcapacity("0",&sd_size,&free);
    if(0  ==  result)
    {
      LCD_Printf (0,48,16,LCD565_GREEN,"SD卡容量%dKByte,%dMB,%0.5fGB",sd_size,sd_size>>10,(double)(sd_size>>10)/1024);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
      //========================获取剩余容量    
      LCD_Printf (0,64,16,LCD565_GREEN,"SD卡剩余容量%dKByte,%dMB,%0.5fGB",free,free>>10,(double)(free>>10)/1024);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
      free  = sd_size-free;
      LCD_Printf (0,80,16,LCD565_GREEN,"已用容量%dKByte,%dMB,%0.5fGB",free,free>>10,(double)(free>>10)/1024);					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
    }
    else
    {
      LCD_Printf (0,48,16,LCD565_GREEN,"容量信息查询失败");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
      return;
    }
  }
  else
  {
    LCD_Printf (0,32,16,LCD565_GREEN,"驱动器注册失败");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
    return;
  }
  //========================查找指定文件
  LCD_Printf (0,96,16,LCD565_GREEN,"查找指定文件:bmp");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
  result  = FilSearch(&FatFsObj[0],&dir,"0:/","bmp",FilSearchInf);  //在指定路径下查找指定扩展名的文件，并记录在(*p)[13]数组中，注意最大记录条数
  if(0 != result)
  {
    unsigned short    i=0;
    unsigned short    j = 0;
    unsigned short    flg=0;
    LCD_Printf (0,112,16,LCD565_GREEN,"查找到bmp文件");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数
    for(i=0;i<FileNum;i++)
    {
      if(0  !=  FilSearchInf[i][0])
      {
        unsigned char k = 0;
        for(k=0;k<13;++k)
        {
          if(0  ==  FilSearchInf[i][k])
            break;
        }
        //===============打印查找的bmp文件名
        LCD_Show(0,128+i*16,16,LCD565_GREEN,k,FilSearchInf[i]);
      }
    }
    while(1)
    {
//      i=0;
//      j=0;
      //===============================图片1
      for(i=0;i<FileNum;i++)
      {
        if(FilSearchInf[i][0] !=0)
        {
          yv  = 0;
          flg = 0;
          result  = f_open(&fsrc,&FilSearchInf[i][0],FA_READ);
//          if(result)
//            break;
          for(j=0;j<480;j++)
          {
            if(flg==0)
            {
              result  = f_read(&fsrc,buffer,54,&br);
            }
            else
            {
              result  = f_read(&fsrc,buffer,2400,&br);
            }
            if(FR_OK  !=  result)
            {
    //          return;
            }
            da  = 0;
            if(flg==0)
            {
              flg = 1;
              da  = 0;
              result  = f_read(&fsrc,buffer,2400,&br);
            }

            LCD_ShowBMP(0,yv,800,yv,br,buffer);    //显示十六进制数据
            yv+=1;
            if(yv>=480)
              yv  = 0;
          }
//          SysTick_DeleyS(3);					//SysTick延时nS
        }
      }           
    }    
  }
  else
  {    
    LCD_Printf (0,112,16,LCD565_GREEN,"未找到bmp文件");					//自定义printf串口DMA发送程序,后边的省略号就是可变参数    
  }
//  f_getfree();  

}
#endif
